{
  "meta": {
    "title": "API CoDi - Sistema de Pagos Digitales Gratuito del Banco de México | Pablo Cruz",
    "ogTitle": "API CoDi - Sistema de Pagos Digitales Gratuito del Banco de México",
    "description": "API REST Node.js lista para producción para pagos digitales sin comisiones en México. Se integra con el sistema CoDi oficial de Banxico utilizando firmas digitales RSA."
  },
  "header": {
    "backButton": "← Volver al Portafolio",
    "title": "API CoDi del Banco de México",
    "description": "API de código abierto que permite a empresas mexicanas generar solicitudes de pago a través del sistema CoDi del Banco Central de México. Cero comisiones por transacción, depósitos inmediatos, seguridad de nivel bancario y documentación completa."
  },
  "toc": {
    "heading": "Tabla de Contenidos",
    "overview": "Descripción del Proyecto",
    "whatIsCodi": "¿Qué es CoDi?",
    "architecture": "Arquitectura Técnica",
    "features": "Características Principales",
    "qrPayments": "Pagos con Código QR",
    "pushPayments": "Notificaciones Push",
    "paymentQueries": "Consultas de Estado de Pago",
    "webhooks": "Integración de Webhooks",
    "security": "Arquitectura de Seguridad",
    "documentation": "Documentación Interactiva",
    "techStack": "Stack Tecnológico y Decisiones de Diseño",
    "deployment": "Despliegue e Infraestructura",
    "testing": "Estrategia de Pruebas",
    "challenges": "Desafíos y Soluciones",
    "futureWork": "Mejoras Futuras",
    "conclusion": "Conclusión"
  },
  "navigation": {
    "githubRepo": "Ver Repositorio en GitHub",
    "liveDemo": "Ver Documentación en Vivo",
    "backToTop": "Volver Arriba",
    "backToPortfolio": "Volver al Portafolio",
    "viewOnGithub": "Ver en GitHub",
    "documentation": "Documentación"
  },
  "contact": {
    "heading": "¿Interesado en Este Proyecto?",
    "description": "Me encantaría platicar sobre este proyecto, responder tus preguntas o explorar oportunidades de colaboración.",
    "emailButton": "Contáctame"
  },
  "intro": {
    "para1": "En esta publicación, explicaré cómo construí una API REST lista para producción que permite a empresas en México aceptar pagos digitales con cero comisiones por transacción y depósitos inmediatos. La API se integra con el sistema oficial de pagos CoDi del Banco de México (Banxico) y es completamente de código abierto bajo la licencia Apache 2.0.",
    "para2": "Si quieres ir directamente al código, puedes visitar el",
    "githubLink": "repositorio de GitHub",
    "para2b": ". También puedes explorar el",
    "docsLink": "sitio de documentación en vivo",
    "para2c": "o probar el",
    "playgroundLink": "playground interactivo de la API",
    "para3": "¿Te gustaría implementar CoDi para tu negocio?",
    "getInTouch": "Contáctame",
    "para3b": "y te ayudaré a integrarlo."
  },
  "overview": {
    "heading": "Descripción del Proyecto",
    "para1": "La API CoDi es una API REST de producción que resuelve un problema crítico para las empresas mexicanas: aceptar pagos digitales sin pagar altas comisiones por transacción. Los procesadores de pago tradicionales cobran entre 2-4% por transacción (más 16% de IVA), lo que puede impactar significativamente los márgenes de ganancia, especialmente para pequeñas empresas.",
    "para2": "Al integrarse directamente con el sistema CoDi de Banxico, esta API permite a las empresas aceptar pagos desde cualquier cuenta bancaria mexicana a través de códigos QR o notificaciones push a aplicaciones bancarias móviles, con cero comisiones por transacción.",
    "imageCaption": "Sitio de Documentación de la API CoDi - Guías completas y herramientas interactivas para desarrolladores",
    "highlightsHeading": "Aspectos Destacados del Proyecto",
    "highlight1": "Listo para Producción:",
    "highlight1Text": "API en vivo procesando pagos reales activamente",
    "highlight2": "Integración Gubernamental:",
    "highlight2Text": "Integración oficial con el sistema CoDi de Banxico",
    "highlight3": "Cero Comisiones:",
    "highlight3Text": "Sin comisiones por transacción, nunca",
    "highlight4": "Seguridad de Nivel Bancario:",
    "highlight4Text": "Firmas digitales RSA y autenticación por certificados",
    "highlight5": "Código Abierto:",
    "highlight5Text": "Licencia Apache 2.0, completamente transparente",
    "highlight6": "Documentación Completa:",
    "highlight6Text": "Playground interactivo, generadores de código y guías detalladas",
    "highlight7": "Mercado Mexicano:",
    "highlight7Text": "Construido específicamente para la infraestructura de pagos de México"
  },
  "whatIsCodi": {
    "heading": "¿Qué es CoDi?",
    "para1": "CoDi (Cobro Digital) es el sistema oficial de pagos digitales del Banco Central de México, lanzado en 2019 para promover la inclusión financiera y proporcionar una alternativa moderna a los pagos en efectivo y con tarjeta.",
    "howWorksHeading": "Cómo Funciona CoDi",
    "howWorksPara": "A diferencia de los procesadores de pago tradicionales, CoDi opera directamente a través del sistema bancario. Cuando un cliente realiza un pago CoDi, el dinero se transfiere instantáneamente desde su cuenta bancaria a la cuenta bancaria del comerciante, sin intermediarios que se lleven una comisión.",
    "paymentMethodsIntro": "El sistema soporta dos métodos de pago:",
    "method1": "Pagos con Código QR:",
    "method1Text": "El cliente escanea un código QR con su aplicación bancaria para autorizar el pago",
    "method2": "Notificaciones Push:",
    "method2Text": "La solicitud de pago se envía directamente a la aplicación bancaria móvil del cliente",
    "benefitsHeading": "Beneficios Clave de CoDi",
    "benefit1": "Cero Comisiones por Transacción:",
    "benefit1Text": "Sin comisiones cobradas a comerciantes o clientes",
    "benefit2": "Transferencia Inmediata de Dinero:",
    "benefit2Text": "Fondos disponibles de inmediato",
    "benefit3": "Trazabilidad Completa:",
    "benefit3Text": "Rastro de auditoría completo de todas las transacciones",
    "benefit4": "Seguridad de Nivel Bancario:",
    "benefit4Text": "Protegido por las mismas medidas de seguridad que la banca en línea",
    "benefit5": "Compatibilidad Universal:",
    "benefit5Text": "Funciona con todos los bancos mexicanos",
    "workflowCaption": "Proceso de Pago CoDi en 3 Pasos: Generar solicitud de pago, cliente autoriza, confirmación instantánea"
  },
  "architecture": {
    "heading": "Arquitectura Técnica",
    "para1": "La API CoDi está construida como una capa de middleware Node.js/Express que maneja la autenticación compleja y la comunicación con la infraestructura de pagos de Banxico, exponiendo una API REST simple a las aplicaciones cliente.",
    "simplifiedCaption": "Vista general simplificada de la arquitectura mostrando los componentes principales y el flujo de datos",
    "componentsHeading": "Componentes de la Arquitectura",
    "componentsIntro": "El sistema consiste en varias capas clave:",
    "component1": "Capa de API REST (Express.js):",
    "component1Text": "Maneja solicitudes entrantes, validación y respuestas",
    "component2": "Capa de Autenticación:",
    "component2Text": "Gestiona firmas digitales RSA y validación de certificados",
    "component3": "Capa de Integración con Banxico:",
    "component3Text": "Se comunica con los endpoints CoDi de Banxico",
    "component4": "Arquitectura de Respaldo:",
    "component4Text": "Soporte de múltiples endpoints con lógica de reintento automático",
    "component5": "Persistencia de Datos (Supabase):",
    "component5Text": "Almacena claves API, registros de pago y logs de auditoría",
    "component6": "Sistema de Webhooks:",
    "component6Text": "Entrega confirmaciones de pago en tiempo real a aplicaciones cliente",
    "detailedCaption": "Diagrama detallado de arquitectura mostrando el flujo completo de datos desde la aplicación cliente a través de la API CoDi hasta Banxico",
    "requestFlowHeading": "Flujo de Solicitud",
    "requestFlowIntro": "Esto es lo que sucede cuando una aplicación cliente solicita un pago:",
    "flow1": "El cliente envía una solicitud POST con detalles del pago (monto, descripción, etc.)",
    "flow2": "La API valida la solicitud y autentica usando la clave API",
    "flow3": "Los datos del pago se firman con el certificado RSA",
    "flow4": "La solicitud firmada se envía al sistema CoDi de Banxico",
    "flow5": "Banxico genera el código QR o envía la notificación push",
    "flow6": "La API almacena el registro de transacción en PostgreSQL",
    "flow7": "La respuesta se devuelve al cliente con el código QR o confirmación",
    "flow8": "Cuando el cliente paga, se envía una notificación webhook a la URL de callback del cliente"
  },
  "features": {
    "heading": "Características Principales",
    "intro": "La API CoDi proporciona seis características principales, cada una diseñada para hacer que la integración de pagos digitales sea lo más simple posible mientras se mantiene seguridad y confiabilidad de nivel empresarial.",
    "qrHeading": "1. Generación de Pagos con Código QR",
    "qrPara": "Genera códigos QR compatibles con CoDi que los clientes pueden escanear con cualquier aplicación bancaria mexicana. Los códigos QR son dinámicos, lo que significa que contienen toda la información del pago y pueden expirar después de un tiempo especificado.",
    "qr1": "Rango de pago: $1 - $12,500 MXN por transacción",
    "qr2": "Expiración personalizable (incluyendo sin expiración)",
    "qr3": "Incluye números de referencia y descripciones personalizadas",
    "qr4": "Código QR codificado en Base64 devuelto en la respuesta de la API",
    "qrCaption": "Documentación Swagger para el endpoint /v2/codi/qr",
    "pushHeading": "2. Notificaciones de Pago Push",
    "pushPara": "Envía solicitudes de pago directamente a la aplicación bancaria móvil de un cliente usando su número de teléfono. El cliente recibe una notificación y puede autorizar el pago con un solo toque.",
    "push1": "Entrega instantánea a la aplicación bancaria del cliente",
    "push2": "No se requiere escaneo de código QR",
    "push3": "Perfecto para pagos remotos",
    "push4": "Actualizaciones de estado de pago en tiempo real",
    "pushCaption": "Documentación Swagger para el endpoint /v2/codi/push",
    "queryHeading": "3. Consultas de Estado de Pago",
    "queryPara": "Verifica el estado de cualquier pago usando su número de referencia único folioCoDi. Esto permite verificación de pago en tiempo real y seguimiento del historial de transacciones.",
    "query1": "Verificación de pago en tiempo real",
    "query2": "Búsqueda de historial de transacciones",
    "query3": "Capacidades de rastro de auditoría",
    "query4": "Información detallada del pago",
    "webhookHeading": "4. Integración de Webhooks",
    "webhookPara": "Recibe notificaciones automáticas cuando se completan los pagos. Configura una URL de callback, y la API enviará datos de confirmación de pago a tu servidor cuando un cliente pague.",
    "webhook1": "Confirmaciones automáticas de pago",
    "webhook2": "URLs de callback configurables",
    "webhook3": "Firma segura de webhooks",
    "webhook4": "Lógica de reintento para entregas fallidas",
    "securityHeading": "5. Arquitectura de Seguridad",
    "securityPara": "Las características de seguridad de nivel empresarial protegen tanto la API como tus datos de pago. Cada solicitud a Banxico está firmada digitalmente con certificados RSA, y todas las comunicaciones están encriptadas.",
    "security1": "Firmas digitales RSA (mínimo 2048 bits)",
    "security2": "Autenticación basada en certificados con Banxico",
    "security3": "Gestión de claves API a través de Supabase",
    "security4": "Registro de solicitudes/respuestas para rastros de auditoría",
    "security5": "Protección CORS con lista blanca de IPs",
    "security6": "Limitación de tasa (200 solicitudes por 15 minutos)",
    "security7": "Encabezados de seguridad Helmet.js",
    "docsHeading": "6. Documentación Interactiva",
    "docsPara": "La documentación completa con herramientas interactivas hace que la integración sea sencilla, incluso para desarrolladores nuevos en el procesamiento de pagos.",
    "docs1": "Especificación Swagger/OpenAPI 3.0",
    "docs2": "Funcionalidad de prueba para todos los endpoints",
    "docs3": "Guías de integración paso a paso en español",
    "docs4": "Generadores de código para múltiples lenguajes",
    "docs5": "Playground interactivo de API"
  },
  "devExperience": {
    "heading": "Experiencia del Desarrollador",
    "intro": "Una gran API necesita gran documentación y herramientas. La API CoDi incluye un sitio de documentación completo con características interactivas que hacen que la integración sea más rápida y la depuración más fácil.",
    "playgroundHeading": "Playground Interactivo de API",
    "playgroundPara": "Prueba todos los endpoints de la API directamente desde tu navegador sin escribir ningún código. El playground incluye ejemplos prellenados y valida tus solicitudes en tiempo real.",
    "playgroundCaption": "Playground de API en vivo para probar generación de QR, notificaciones push y consultas de pago",
    "generatorHeading": "Generadores de Código",
    "generatorPara": "Genera código de integración listo para usar en múltiples lenguajes de programación. Simplemente selecciona tu endpoint e idioma, y obtén ejemplos de código listos para producción.",
    "generatorCaption": "Generador de código que soporta cURL, JavaScript (Fetch) y Python (requests)",
    "toolsHeading": "Herramientas Adicionales para Desarrolladores",
    "tool1": "Monitor de Estado del Servicio:",
    "tool1Text": "Panel de disponibilidad de API en tiempo real",
    "tool2": "Búsqueda de Códigos de Institución:",
    "tool2Text": "Base de datos de referencia de instituciones financieras",
    "tool3": "Guías de Integración:",
    "tool3Text": "Tutoriales paso a paso en español",
    "tool4": "Referencia de Códigos de Error:",
    "tool4Text": "Explicaciones detalladas de todas las respuestas de error"
  },
  "techStack": {
    "heading": "Análisis Profundo del Stack Tecnológico",
    "intro": "La API CoDi está construida con tecnologías modernas y probadas elegidas por su confiabilidad, rendimiento y capacidades de seguridad.",
    "backendHeading": "Tecnologías Backend",
    "backendCodeTitle": "Stack Backend",
    "securityHeading": "Stack de Seguridad",
    "securityCodeTitle": "Tecnologías de Seguridad",
    "integrationsHeading": "Integraciones Clave",
    "integration1": "API de Banxico:",
    "integration1Text": "Endpoints oficiales del sistema de pagos CoDi",
    "integration2": "Supabase:",
    "integration2Text": "Base de datos, almacenamiento de claves API, registro de solicitudes/respuestas",
    "integration3": "Generación de Códigos QR:",
    "integration3Text": "Códigos QR de pago dinámicos",
    "integration4": "Webhooks:",
    "integration4Text": "Notificaciones de pago asíncronas",
    "devopsHeading": "Desarrollo y DevOps",
    "devops1": "Control de Versiones:",
    "devops1Text": "Git/GitHub",
    "devops2": "CI/CD:",
    "devops2Text": "Flujo de despliegue con GitHub Actions",
    "devops3": "Gestión de Entorno:",
    "devops3Text": "dotenv para configuración",
    "devops4": "Cumplimiento de Licencias:",
    "devops4Text": "Verificación y reporte automatizado de licencias"
  },
  "database": {
    "heading": "Arquitectura de Base de Datos",
    "intro": "La API usa Supabase (PostgreSQL) para persistencia de datos, con un esquema que soporta múltiples clientes, registro de auditoría completo y seguimiento de pagos.",
    "schemaHeading": "Esquema de Base de Datos",
    "schemaPara": "La base de datos consiste en 5 tablas principales que trabajan juntas para gestionar clientes, claves API, transacciones de pago y registro completo de auditoría:",
    "schemaCaption": "Diagrama de esquema de base de datos mostrando las 5 tablas principales y sus relaciones",
    "integrityHeading": "Características de Integridad de Datos",
    "integrity1": "Las restricciones de clave foránea aseguran la integridad referencial",
    "integrity2": "Las columnas de marca de tiempo rastrean creación y actualizaciones",
    "integrity3": "La segregación de entornos previene la mezcla de datos de prueba/producción",
    "integrity4": "Consultas indexadas para búsquedas rápidas de pagos"
  },
  "securityDeep": {
    "heading": "Análisis Profundo de Características de Seguridad",
    "intro": "La seguridad es primordial al manejar transacciones financieras. La API CoDi implementa múltiples capas de seguridad para proteger datos sensibles de pago y asegurar el cumplimiento con regulaciones bancarias.",
    "signatureHeading": "Autenticación de Firma Digital",
    "signaturePara": "Cada solicitud a Banxico está firmada digitalmente usando certificados RSA. Esto asegura que Banxico pueda verificar que la solicitud se originó de una instancia autorizada de la API CoDi y no ha sido alterada.",
    "signatureCodeTitle": "JavaScript - Generación de Firma Digital",
    "validationHeading": "Validación de Certificados",
    "validationPara": "La API valida certificados RSA comparando números de serie y verificando la autenticidad del certificado antes de aceptar cualquier solicitud. Esto previene el acceso no autorizado incluso si alguien obtiene una clave API válida.",
    "ipHeading": "Lista Blanca de IPs y Control de Acceso",
    "ipPara": "El sistema implementa lista blanca estricta de IPs a través de tres capas de seguridad para asegurar que solo clientes autorizados puedan acceder a la infraestructura de pagos:",
    "ip1": "Capa de Firewall:",
    "ip1Text": "El filtrado de IP a nivel de red bloquea tráfico no autorizado antes de que llegue a la aplicación",
    "ip2": "Capa de API:",
    "ip2Text": "La validación de IP a nivel de aplicación asegura que solo IPs de clientes registrados puedan hacer solicitudes a la API",
    "ip3": "Capa Bancaria:",
    "ip3Text": "Banxico requiere direcciones IP pre-registradas para todas las conexiones al sistema CoDi, proporcionando un punto de control de seguridad adicional",
    "ipConclusion": "Esta arquitectura de restricción de IP multicapa asegura que incluso con credenciales válidas, el acceso solo sea posible desde ubicaciones de red aprobadas, reduciendo significativamente la superficie de ataque.",
    "keyHeading": "Gestión de Claves API",
    "keyPara": "Las claves API son cadenas hexadecimales de 128 caracteres almacenadas de forma segura en Supabase. Cada clave está vinculada a un cliente específico y entorno (Beta o Producción), con límites de tasa y permisos individuales.",
    "sanitizationHeading": "Sanitización de Solicitudes",
    "sanitizationPara": "Todas las solicitudes entrantes son sanitizadas para prevenir inyección SQL, ataques XSS y otras vulnerabilidades comunes. La validación de entrada asegura que solo datos con formato apropiado lleguen a la capa de integración con Banxico.",
    "rateLimitHeading": "Limitación de Tasa",
    "rateLimitPara": "La API implementa limitación de tasa para prevenir abuso y asegurar asignación justa de recursos. El límite predeterminado es 200 solicitudes por ventana de 15 minutos por clave API.",
    "headersHeading": "Encabezados de Seguridad",
    "headersPara": "Helmet.js agrega encabezados de seguridad a todas las respuestas, protegiendo contra vulnerabilidades web comunes como clickjacking, XSS y detección de tipo de contenido."
  },
  "apiEndpoints": {
    "heading": "Referencia de Endpoints de API",
    "intro": "La API CoDi expone 5 endpoints principales para gestionar pagos digitales. Todos los endpoints requieren autenticación de clave API a través del encabezado <code>x-api-key</code>.",
    "tableHeading": "Vista General de Endpoints",
    "tableCol1": "Endpoint",
    "tableCol2": "Método",
    "tableCol3": "Propósito",
    "endpoint1": "Verificación de salud y estado del sistema",
    "endpoint2": "Generar solicitud de pago con código QR",
    "endpoint3": "Enviar solicitud de pago por notificación push",
    "endpoint4": "Consultar estado de pago por folioCoDi",
    "endpoint5": "Endpoint de webhook para callbacks de pago",
    "endpointsCaption": "Documentación Swagger completa mostrando todos los endpoints de API organizados por categoría"
  },
  "useCases": {
    "heading": "Casos de Uso",
    "intro": "La API CoDi es versátil y puede integrarse en una amplia variedad de aplicaciones empresariales. Aquí están los casos de uso más comunes:",
    "ecommerceHeading": "1. Plataformas de Comercio Electrónico",
    "ecommercePara": "Las tiendas en línea pueden integrar CoDi como opción de pago al momento del checkout, ofreciendo a los clientes una alternativa sin comisiones a las tarjetas de crédito.",
    "ecommerce1": "Integración con carrito de compras",
    "ecommerce2": "Flujos de confirmación de pedidos",
    "ecommerce3": "Actualizaciones automáticas de inventario al recibir el pago",
    "ecommerce4": "Recibos y facturas por correo electrónico",
    "posHeading": "2. Sistemas de Punto de Venta",
    "posPara": "Las ubicaciones de comercio físico pueden usar CoDi para pagos en persona, mostrando códigos QR en el mostrador o enviando notificaciones push.",
    "pos1": "Mostradores de pago en comercio minorista",
    "pos2": "Escritorios de servicio y quioscos",
    "pos3": "Terminales POS móviles",
    "pos4": "Sistemas de pago para restaurantes",
    "serviceHeading": "3. Proveedores de Servicios",
    "servicePara": "Las empresas basadas en servicios pueden solicitar pagos de forma remota a través de notificaciones push, perfecto para facturación recurrente o servicios bajo demanda.",
    "service1": "Pagos de servicios públicos y facturas",
    "service2": "Servicios de suscripción",
    "service3": "Servicios profesionales (consultores, freelancers)",
    "service4": "Servicios de mantenimiento y reparación",
    "marketplaceHeading": "4. Mercados",
    "marketplacePara": "Las plataformas multi-vendedor pueden usar CoDi para manejar transacciones peer-to-peer entre compradores y vendedores.",
    "marketplace1": "Plataformas de transacciones peer-to-peer",
    "marketplace2": "Anuncios clasificados y listados",
    "marketplace3": "Mercados freelance",
    "marketplace4": "Plataformas basadas en comisiones",
    "ctaText": "¿Te gustaría implementar CoDi para tu negocio?",
    "ctaLink": "Contáctame",
    "ctaText2": "y te ayudaré a integrarlo."
  },
  "openSource": {
    "heading": "Código Abierto y Comunidad",
    "intro": "La API CoDi es de código abierto bajo la licencia Apache 2.0, lo que significa que puedes usarla comercialmente, modificarla, distribuirla e incluso patentarla, con restricciones mínimas.",
    "licenseHeading": "Beneficios de la Licencia Apache 2.0",
    "license1": "Uso Comercial:",
    "license1Text": "Usa la API en productos comerciales sin tarifas",
    "license2": "Modificación:",
    "license2Text": "Personaliza el código para ajustarse a tus necesidades específicas",
    "license3": "Distribución:",
    "license3Text": "Distribuye versiones modificadas o sin modificar",
    "license4": "Concesión de Patente:",
    "license4Text": "Protección contra demandas de patentes",
    "license5": "Sin Garantía:",
    "license5Text": "Proporcionado \"tal cual\" sin responsabilidad",
    "contributingHeading": "Contribuir al Proyecto",
    "contributingPara": "¡Las contribuciones son bienvenidas! Ya sea que estés arreglando errores, agregando funciones, mejorando la documentación o reportando problemas, tu ayuda hace que el proyecto sea mejor para todos.",
    "howToHeading": "Cómo Contribuir",
    "howTo1": "Haz fork del repositorio en GitHub",
    "howTo2": "Crea una rama de funcionalidad (<code>git checkout -b feature/nueva-funcionalidad</code>)",
    "howTo3": "Haz commit de tus cambios (<code>git commit -m 'Agregar nueva funcionalidad'</code>)",
    "howTo4": "Haz push a la rama (<code>git push origin feature/nueva-funcionalidad</code>)",
    "howTo5": "Abre un Pull Request",
    "resourcesHeading": "Recursos de la Comunidad",
    "resource1": "GitHub Issues:",
    "resource1Text": "Reporta errores y solicita funciones",
    "resource2": "GitHub Discussions:",
    "resource2Text": "Haz preguntas y comparte ideas",
    "resource3": "Documentación:",
    "resource3Text": "Guías completas y referencia de API",
    "resource4": "Ejemplos de Código:",
    "resource4Text": "Ejemplos de integración del mundo real"
  },
  "links": {
    "heading": "Enlaces del Proyecto y Recursos",
    "liveHeading": "Servicios en Vivo",
    "live1": "Endpoint de API",
    "live1Desc": "- URL base de la API de producción",
    "live2": "Sitio de Documentación",
    "live2Desc": "- Guías completas y tutoriales",
    "live3": "Playground de API",
    "live3Desc": "- Entorno de pruebas interactivo",
    "live4": "Documentación Swagger",
    "live4Desc": "- Referencia completa de la API",
    "codeHeading": "Código y Comunidad",
    "code1": "Repositorio de GitHub",
    "code1Desc": "- Código fuente y README",
    "code2": "Issues",
    "code2Desc": "- Reportes de errores y solicitudes de funciones",
    "code3": "Discusiones",
    "code3Desc": "- Preguntas de la comunidad e ideas",
    "externalHeading": "Recursos Externos",
    "external1": "CoDi Oficial de Banxico",
    "external1Desc": "- Información de CoDi del Banco de México"
  }
}
